Revit 2027 API
CategoryNameMap.ReverseIterator Method
Retrieve a backward moving iterator to the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual CategoryNameMapIterator ReverseIterator()
Public Overridable Function ReverseIterator As CategoryNameMapIterator
public:
virtual CategoryNameMapIterator^ ReverseIterator()
abstract ReverseIterator : unit -> CategoryNameMapIterator
override ReverseIterator : unit -> CategoryNameMapIterator
Return Value
CategoryNameMapIterator
Returns a backward moving iterator to the map.
See Also
Reference
CategoryNameMap Class
Autodesk.Revit.DB Namespace